run/unsteady/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1.0;

deltaT          1e-5;

maxDeltaT		2e-3;

writeControl    runTime;

writeInterval   0.01111111;

adjustTimeStep  yes;

maxCo           3;
maxDeltaT       5e-4;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc forceCoeffs
    #includeFunc yPlus
    #includeFunc solverInfo
    #includeFunc Q
    #includeFunc Lambda2
    #includeFunc vorticity
    #includeFunc wallShearStress
    #includeFunc pressureCoeff

}


// ************************************************************************* //
