run/unsteady/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        smoother         GaussSeidel;
        tolerance        1e-7;
        relTol           0.001;
    }

    pFinal
    {
        $p;
        relTol           0;
    }

    U
    {
        solver           smoothSolver;
        smoother         symGaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    k
    {
        $U;
    }

    omega
    {
        $U;
    }

    "(U|k|omega)Final"
    {
        $U;
        relTol           0;
    }
}

PIMPLE
{
    nOuterCorrectors            3;
    nCorrectors                 1;
    nNonOrthogonalCorrectors    1;
    consistent                  no;
    turbOnFinalIterOnly         no;
}

relaxationFactors
{
    fields
    {
        p           0.3;
        pFinal      1;
    }
    equations
    {
        U           0.7;
        "(k|omega)" 0.7;
        ".*Final"   1;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
